huyns1998/rosserial_stm32f407/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/


/* USER CODE BEGIN EFP */
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define INT1_Pin GPIO_PIN_0
#define INT1_GPIO_Port GPIOA
#define INT2_Pin GPIO_PIN_1
#define INT2_GPIO_Port GPIOA
#define INT3_Pin GPIO_PIN_4
#define INT3_GPIO_Port GPIOA
#define INT4_Pin GPIO_PIN_5
#define INT4_GPIO_Port GPIOA
#define DC1_C2_Pin GPIO_PIN_6
#define DC1_C2_GPIO_Port GPIOA
#define DC2_C2_Pin GPIO_PIN_7
#define DC2_C2_GPIO_Port GPIOA
#define DC2_TIM_PWM_Pin GPIO_PIN_9
#define DC2_TIM_PWM_GPIO_Port GPIOE
#define DC1_TIM_PWM_Pin GPIO_PIN_14
#define DC1_TIM_PWM_GPIO_Port GPIOE
#define DC2_TIM_IC_Pin GPIO_PIN_10
#define DC2_TIM_IC_GPIO_Port GPIOB
#define DC1_TIM_IC_Pin GPIO_PIN_3
#define DC1_TIM_IC_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
void Error_Handler(void);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
